{
  "title": "Canada - Tourist/Visit Visa",
  "image": "https://cg-website-s3.s3.ap-south-1.amazonaws.com/0000/7/2024/12/17/icons8-canada-72.png",
 "visa_fee": "Embassy Fee: 18,500 BDT per person (subject to conversion rate); Chologhuri File Processing Fee: 5,000 BDT per person",
  "processing_time": "20–30 working days (Embassy) + 8–10 working days (file processing)",
  "validity": "Temporary Resident Visa – Tourist / Business Visit",
  "details": [
    {
      "title": "Eligibility",
      "items": [
        "Bangladeshi citizens with valid passports (minimum 6 months validity and at least 2 blank pages)",
        "Applicants with valid USA visa or previous Canada visa (recommended but not mandatory)",
        "Must provide full travel and employment history"
      ]
    },
    {
      "title": "Required Documents",
      "items": [
       "Valid passport (with minimum 6 months validity and blank pages)",
        "Copy of valid USA visa or previous Canada visa (if applicable)",
        "Copies of previous passports and issued visas",
        "Forwarding Letter (provided by Chologhuri)",
        "NOC from employer OR Trade License (for business person)",
        "Professional certificates: Bar Council (Lawyer), BMDC (Doctor), Retirement proof (if retired)",
        "Income Tax Return (ITR)",
        "Last 6 months personal bank statement with solvency certificate",
        "NID and Birth Certificate for children (if applicable)",
        "Marriage Certificate (if married)",
         "Travel dates (from and to)",
        "Inviter’s details (if any): Name, address, postal code, phone number",
        "Post-secondary education details: from/to (Year-Month), field of study, institution name",
        "Employment history for the last 10 years: from/to (Year-Month), occupation, company name",
        "Father and Mother’s name, date/place of birth, occupation or date of death",
        "Details of all children: Name, DOB, address (if different)",
        "If refused any visa previously: country, year, and reason"
      ]
    }
  ],
  "note": "All expenditures related to visa processing are strictly non-refundable. Visa information and associated charges are subject to change at any time without prior notice. We provide assistance only and do not guarantee the issuance of visas. This information sheet has been prepared by us and may include additional details beyond the embassy's requirements."
}