{
  "title": "Egypt - Tourist/Visit Visa",
  "image": "https://cg-website-s3.s3.ap-south-1.amazonaws.com/0000/7/2024/12/17/icons8-egypt-72.png",
   "visa_fee": "10,000 BDT (Embassy + Chologhuri Processing Fee)",
  "processing_time": "35–40 working days (Embassy) + 1–2 working days (File preparation)",
  "validity": "Determined by embassy upon approval",
  "details": [
    {
      "title": "Eligibility",
      "items": [
        "Valid Bangladeshi passport with at least 6 months validity from travel date",
        "Minimum personal bank balance of 500,000 BDT per person",
        "Basic travel purpose must be tourism or business only",
        "Proof of financial means, hotel booking, and supporting job/business/student documents",
        "Marriage certificate (notarized and translated) if spouse’s name is not in passport",
        "NID and utility bill copies must be submitted",
        "All current and previous passports must be submitted"
      ]
    },
    {
      "title": "Required Documents",
      "items": [
        "Valid passport (minimum 6 months validity) and all previous passports",
        "Two recent passport-size photos (white background, no cap or glasses)",
        "Two sets of visiting cards",
        "Personal bank statement for last 6 months and solvency certificate (original with seal)",
        "NID card copy",
        "Utility bill copy",
        "Hotel booking (arranged by Chologhuri)",
        "Marriage certificate (notarized and English translated, if applicable)",
        "For Job Holders: NOC, office ID card, salary slip (last 3 months), GO (for govt.), BMDC/BAR/Retirement certificate as applicable",
        "For Business Persons: Office pad, renewed trade license with notarized English copy, memorandum (for limited companies)",
        "For Students: Photocopies of student ID (both sides), birth certificate"
      ]
    }
  ],
  "note": "All expenditures related to visa processing are strictly non-refundable. Visa information and associated charges are subject to change at any time without prior notice. We provide assistance only and do not guarantee the issuance of visas. This information sheet has been prepared by us and may include additional details beyond the embassy's requirements."
}