{
  "title": "New Zealand - Tourist/Visit Visa",
  "image": "https://cg-website-s3.s3.ap-south-1.amazonaws.com/0000/7/2024/12/17/icons8-new-zealand-72.png",
  "visa_fee": "33,500 BDT (Visa Fee) + 5,000 BDT (Service Fee) + 3,000 BDT (Optional Urgent Fee)",
  "processing_time": "33 days (Embassy) + 7 working days (File processing)",
  "validity": "Up to 90 days (determined by visa officer)",
  "details": [
    {
      "title": "Eligibility",
      "items": [
        "Valid Bangladeshi passport with all current and expired passports scanned (all pages)",
        "Completed and accurate online visa application form",
        "Clear purpose of visit: tourism, temporary visit, business, or medical treatment",
        "Proof of personal financial means and evidence of accommodation and return ticket",
        "Travel itinerary including full tour plan and hotel booking",
        "Proof of employment or business (NOC, salary slips, trade license, etc.)",
        "Income tax documents (ITR or e-TIN), personal and company if applicable",
        "All documents in Bangla must be translated into English and notarized",
        "New Zealand visa process is fully online, only scanned documents required"
      ]
    },
    {
      "title": "Required Documents",
      "items": [
        "Scanned copies of all current and expired passports (all pages)",
        "Visa application form (online, completed by Chologhuri)",
        "Two recent passport-size photos (3.5mm x 4.5mm), JPEG copy",
        "Personal cover letter mentioning purpose, duration, travel, accommodation, and costs",
        "Forwarding letter/NOC from employer with designation and purpose of travel",
        "Salary certificate or last 3 months' pay slips",
        "Tour plan (places, dates, and purpose) arranged by Chologhuri",
        "Office ID or visiting card",
        "Trade license, company memorandum (if self-employed/business owner)",
        "Personal bank statement (last 6 months) with solvency certificate",
        "Personal ITR or e-TIN certificate",
        "Company bank statement and ITR (for business owners)",
        "Reserved airline ticket and hotel accommodation itinerary (arranged by Chologhuri)",
        "National ID Card or Birth Certificate",
        "Marriage Certificate (if applicable)",
        "Student ID and NOC for students",
        "Family information form (provided by Chologhuri)",
        "Proof of assets/FDR/Sanchaya Patra/deed copy (optional)",
        "All Bangla documents must be translated and notarized (Chologhuri provides service)"
      ]
    }
  ],
  "note": "All expenditures related to visa processing are strictly non-refundable. Visa information and associated charges are subject to change at any time without prior notice. We provide assistance only and do not guarantee the issuance of visas. This information sheet has been prepared by us and may include additional details beyond the embassy's requirements."
}